ICARUS/solvers/OpenFoam/files/system/fvSolution
/*----------------------------------------------------------------------------------*\
|                                                                                    |
|    ANSA_VERSION: 22.1.0                                                            |
|                                                                                    |
|    file created by  A N S A  Mon Feb 28 15:04:06 2022                              |
|                                                                                    |
|    Output from: /home/dvlastos/TzimiNiki/Untitled.ansa                             |
|                                                                                    |
\*----------------------------------------------------------------------------------*/



FoamFile
{
	version 2.0;
	format binary;
	class dictionary;
	location "";
	object fvSolution;
}
/*---------------------------------------------------------------------------*/
/*---------------------------------------------------------------------------*/

solvers
{
 "p.*"
{
        solver           GAMG;
        tolerance        1e-10;
        relTol           0.05;
        smoother         GaussSeidel;
        maxIter         15;
}

"U.*"
{
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-10;
        relTol           0.1;
        nSweeps          1;
}

Phi
{
  $p;
}

"(k|epsilon|omega|nuTilda|kFinal|epsilonFinal|omegaFinal)"
{
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-10;
        relTol           0.1;
        nSweeps          1;
}
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
	consistent	yes;
    residualControl
    {
        p               1e-7;
        U               1e-7;
        k               1e-7;
        omega           1e-7;
        epsilon         1e-7;
        nuTilda         1e-7;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 50;
}

relaxationFactors
{
    //fields
    //{
    //    p               0.3;
    //}
    equations
    {
        U               0.9;
        k               0.9;
        omega           0.9;
        epsilon         0.9;
        nuTilda         0.9;
    }
}

cache
{
    grad(U);
}
